Repository: 84000/data-translation-memory
Catalog: toh109-v4.tmx
Source language: bo
Languages: en

source: སེམས་བསྐྱེད་པ་གསུམ་པ་ནི་སྤོང་བ་ལས་ཡང་དག་པར་བྱུང་བའོ།།
en: The third giving rise to the mind of awakening arises from abandonment.

source: སེམས་བསྐྱེད་པ་བཞི་པ་ནི་འབྲས་བུ་ལས་ཡང་དག་པར་བྱུང་བའོ།།
en: The fourth giving rise to the mind of awakening arises from the result. “

source: ལྷའི་བུ་གཞན་ཡང་སེམས་བསྐྱེད་པ་དང་པོ་ནི་རྒྱུ་རབ་ཏུ་དབྱེ་བའི་ཡན་ལག་གོ།།
en: Furthermore, divine son, the initial giving rise to the mind of awakening is a part of the classification of cause.

source: སེམས་བསྐྱེད་པ་གཉིས་པ་ནི་ཡེ་ཤེས་རབ་ཏུ་དབྱེ་བའི་ཡན་ལག་གོ།།
en: The second giving rise to the mind of awakening is a part of the classification of gnosis.

source: སེམས་བསྐྱེད་པ་གསུམ་པ་ནི་སྤོང་བ་རབ་ཏུ་དབྱེ་བའི་ཡན་ལག་གོ།།
en: The third giving rise to the mind of awakening is a part of the classification of abandonment.

source: སེམས་བསྐྱེད་པ་བཞི་པ་ནི་འབྲས་བུ་རབ་ཏུ་དབྱེ་བའི་ཡན་ལག་གོ།།
en: The fourth giving rise to the mind of awakening is a part of the classification of result. “

source: ལྷའི་བུ་གཞན་ཡང་སེམས་བསྐྱེད་པ་དང་པོ་ནི་སྨན་བསྡུ་བའི་ཚུལ་དུ་བལྟའོ།།
en: Furthermore, divine son, the initial giving rise to the mind of awakening should be viewed as being like the gathering of medicines.

source: སེམས་བསྐྱེད་པ་གཉིས་པ་ནི་སྨན་རབ་ཏུ་དབྱེ་བ་ལ་མཁས་པའི་ཚུལ་དུ་བལྟའོ།།
en: The second giving rise to the mind of awakening should be viewed as being like skill in the classification of medicines.

source: སེམས་བསྐྱེད་པ་གསུམ་པ་ནི་སྨན་སྦྱོར་བ་ལ་མཁས་པའི་ཚུལ་དུ་བལྟའོ།།
en: The third giving rise to the mind of awakening should be viewed as being like skill in concocting medicines.

source: སེམས་བསྐྱེད་པ་བཞི་པ་ནི་ནད་པ་གསོ་བ་ལ་མཁས་པའི་ཚུལ་དུ་བལྟའོ།།
en: The fourth giving rise to the mind of awakening should be viewed as being like skill in treating patients. “

source: ལྷའི་བུ་གཞན་ཡང་སེམས་བསྐྱེད་པ་དང་པོ་ནི་ཆོས་ཀྱི་རྒྱལ་པོའི་རིགས་ཀྱི་རྒྱུད་དུ་འབྱུང་བའི་ཚུལ་དུ་བལྟའོ།།
en: Furthermore, divine son, the initial giving rise to the mind of awakening should be viewed as being like birth into the lineage of a king of Dharma.

source: སེམས་བསྐྱེད་པ་གཉིས་པ་ནི་ཆོས་ཀྱི་རྒྱལ་པོའི་རིགས་ཀྱི་རྒྱུད་ཀྱི་བསླབ་པ་ཡང་དག་པར་འཛིན་པའི་ཚུལ་དུ་བལྟའོ།།
en: The second giving rise to the mind of awakening should be viewed as being like undertaking the training in the lineage of a king of Dharma.

source: སེམས་བསྐྱེད་པ་གསུམ་པ་ནི་ཆོས་ཀྱི་རྒྱལ་པོའི་རིགས་ཀྱི་རྒྱུད་ཀྱི་བསླབ་པ་ཚར་ཕྱིན་པའི་ཚུལ་དུ་བལྟའོ།།
en: The third giving rise to the mind of awakening should be viewed as being like having completed the training in the lineage of a king of Dharma.

source: སེམས་བསྐྱེད་པ་བཞི་པ་ནི་ཆོས་ཀྱི་རྒྱལ་པོའི་རིགས་ཀྱི་རྒྱུད་ཀྱི་བསླབ་པ་ལ་དབང་སྒྱུར་བའི་ཚུལ་དུ་བལྟའོ།།
en: The fourth giving rise to the mind of awakening should be viewed as being like having mastered the training in the lineage of a king of Dharma.”

source: དེ་ནས་ལྷའི་བུ་འོད་རྣམ་པར་ངེས་པའི་འོད་ཟེར་གྱི་འོད་ཀྱིས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།། འཇམ་དཔལ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལམ་གང་དང་ལྡན་ན་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ལམ་མདོར་བསྡུས་པ་གང་།
en: Then, the god Light of the Light Rays of the Light of Certainty asked the ever-youthful Mañjuśrī, “Mañjuśrī, what, in brief, are the paths of bodhisattvas, the paths in possession of which bodhisattvas will quickly and fully awaken to unsurpassed, perfect, complete awakening?” “

source: འཇམ་དཔལ་གྱིས་སྨྲས་པ། ལྷའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ལམ་ནི་མདོར་བསྡུས་ན་འདི་གཉིས་ཏེ། བྱང་ཆུབ་སེམས་དཔའ་དག་ལམ་འདི་གཉིས་དང་ལྡན་ན་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱའོ།།
en: Divine son,” replied Mañjuśrī, “the paths of the bodhisattvas, in brief, are two; possessed of these two paths, bodhisattvas will quickly and fully awaken to unsurpassed, perfect, complete awakening.

source: གཉིས་གང་ཞེ་ན་འདི་ལྟ་སྟེ།
en: What are the two?

source: ཐབས་དང་ཤེས་རབ་བོ།།
en: They are method and wisdom. “

source: དེ་ལ་ཐབས་ནི་བསྡུ་བ་ཤེས་པའོ།། ཤེས་རབ་ནི་ཡོངས་སུ་གཅོད་པ་ཤེས་པའོ།།
en: Regarding these, method is the knowledge of gathering, while wisdom is the knowledge of discernment.

source: ཐབས་ནི་སེམས་ཅན་ལ་བལྟ་བའོ།། ཤེས་རབ་ནི་ཆོས་ཐམས་ཅད་ལ་མི་ལྟ་བའོ།།
en: Method views sentient beings, while wisdom does not view any phenomena.

source: ཐབས་ནི་ཆོས་ལ་སྦྱོར་བ་ཤེས་པའོ།། ཤེས་རབ་ནི་བྲལ་བ་ཤེས་པའོ།།
en: Method is the knowledge of connection to phenomena, while wisdom is the knowledge of separation.

source: ཐབས་ནི་རྒྱུ་ལ་དམིགས་པ་ཤེས་པའོ།། ཤེས་རབ་ནི་རྒྱུ་ཟད་པར་འགྲོ་བའོ།།
en: Method is the knowledge that observes causes, while wisdom proceeds to exhaust causes.

source: ཐབས་ནི་ཆོས་ཐ་དད་པ་ཤེས་པའོ།། ཤེས་རབ་ནི་ཆོས་ཀྱི་དབྱིངས་དབྱེར་མེད་པ་ཤེས་པའོ།།
en: Method is the knowledge of different phenomena, while wisdom is the knowledge of the undifferentiated dharmadhātu.

source: ཐབས་ནི་སངས་རྒྱས་ཀྱི་ཞིང་གི་རྒྱན་ཤེས་པའོ།། ཤེས་རབ་ནི་སངས་རྒྱས་ཀྱི་ཞིང་མཉམ་པ་ཉིད་དབྱེར་མེད་པར་ཤེས་པའོ།།
en: Method is the knowledge of the ornaments of buddha lands, while wisdom is the knowledge that the equality of buddha lands is undifferentiated.

source: ཐབས་ནི་སེམས་ཅན་གྱི་དབང་པོ་དང་སྤྱོད་པ་ལ་འཇུག་པ་ཤེས་པའོ།། ཤེས་རབ་ནི་སེམས་ཅན་དམིགས་སུ་མེད་པར་ཤེས་པའོ།།
en: Method is the knowledge that engages the faculties and conduct of sentient beings, while wisdom is the knowledge that sentient beings cannot be observed.

source: ཐབས་ནི་བྱང་ཆུབ་ཀྱི་རྒྱན་ཐོབ་པར་བྱེད་པ་ཤེས་པའོ།། ཤེས་རབ་ནི་སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པ་ཤེས་པའོ།།
en: Method is the knowledge that obtains the ornaments of awakening, while wisdom is the knowledge of the complete awakening of all the buddhas’ qualities. “

source: ལྷའི་བུ་གཞན་ཡང་མདོར་བསྡུས་པའི་ལམ་གཉིས་ཏེ།
en: Divine son, furthermore, the paths, in brief, are two.

source: གཉིས་གང་ཞེ་ན།
en: What are the two?

source: ཚོགས་ཀྱི་ལམ་དང་། ཡོངས་སུ་གཅོད་པའི་ལམ་མོ།།
en: The path of accumulation and the path of discernment.

source: དེ་ལ་ཚོགས་ཀྱི་ལམ་ནི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལྔ་པོ་དག་གོ།། ཡོངས་སུ་གཅོད་པའི་ལམ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ།།
en: Regarding these, the path of accumulation is the five perfections, while the path of discernment is the perfection of wisdom. “

source: གཞན་ཡང་མདོར་བསྡུས་པའི་ལམ་གཉིས་ཏེ།
en: Furthermore, the paths, in brief, are two.

source: ཆགས་པ་དང་བཅས་པའི་ལམ་དང་། ཆགས་པ་མེད་པའི་ལམ་མོ།།
en: The path with attachment and the path without attachment.

source: དེ་ལ་ཆགས་པ་དང་བཅས་པའི་ལམ་ནི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལྔ་པོ་དག་གོ།། ཆགས་པ་མེད་པའི་ལམ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ།།
en: Regarding these, the path with attachment is the five perfections, while the path without attachment is the perfection of wisdom. “

source: ཟག་པ་དང་བཅས་པའི་ལམ་དང་ཟག་པ་མེད་པའི་ལམ་མོ།།
en: The contaminated path and the uncontaminated path.

source: དེ་ལ་ཟག་པ་དང་བཅས་པའི་ལམ་ནི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལྔ་པོ་དག་གོ།། ཟག་པ་མེད་པའི་ལམ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ།།
en: Regarding these, the contaminated path is the five perfections, while the uncontaminated path is the perfection of wisdom. “

source: ཚད་ཡོད་པར་བྱས་པའི་ལམ་དང་། ཚད་མེད་པར་བྱས་པའི་ལམ་མོ།།
en: The limited path and the unlimited path.

source: དེ་ལ་ཚད་ཡོད་པར་བྱས་པའི་ལམ་ནི་མཚན་མའི་གནས་སོ།། ཚད་མེད་པར་བྱས་པའི་ལམ་ནི་མཚན་མ་མེད་པའི་གནས་སོ།།
en: Regarding these, the limited path is a ground for signs, while the unlimited path is a ground that is without signs. “

source: ཤེས་པའི་ལམ་དང་སྤོང་བའི་ལམ་མོ།།
en: The path of knowledge and the path of abandonment.

source: དེ་ལ་ཤེས་པའི་ལམ་ནི་ས་དང་པོ་ནས་བཟུང་སྟེ་ས་བདུན་པའི་བར་དུའོ།། སྤོང་བའི་ལམ་ནི་ས་བརྒྱད་པ་ནས་བཟུང་སྟེ་ས་བཅུ་པའི་བར་དུའོ།།
en: Regarding these, the path of knowledge ranges from the first level to the seventh level, while the path of abandonment ranges from the eighth level to the tenth level.”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡེ་ཤེས་སྒྲུབ་པ་དཔའ་བོས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།། འཇམ་དཔལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཇི་ལྟར་ན་དོན་གྱིས་རབ་ཏུ་ཕྱེ་བ་ཡིན།
en: Then, the bodhisattva great being Hero Cultivating Gnosis asked the ever-youthful Mañjuśrī, “Mañjuśrī, how are bodhisattva great beings distinguished in terms of object?

source: ཇི་ལྟར་ན་ཡེ་ཤེས་ཀྱིས་རབ་ཏུ་ཕྱེ་བ་ཡིན།
en: How are they distinguished in terms of gnosis?” “

source: འཇམ་དཔལ་གྱིས་སྨྲས་པ། རིགས་ཀྱི་བུ་དོན་ནི་ལྡན་པ་མེད་པའོ།། ཡེ་ཤེས་ནི་ལྡན་པའོ།།
en: Son of good family,” replied Mañjuśrī, “the object is dissociated, but the gnosis is associated.”

source: སྨྲས་པ། འཇམ་དཔལ་ཅིའི་ཕྱིར་དོན་ནི་ལྡན་པ་མེད་ལ་ཡེ་ཤེས་ནི་ལྡན་པ་ཡིན།
en: He asked, “Mañjuśrī, why is the object dissociated but the gnosis associated?” “

source: འཇམ་དཔལ་གྱིས་སྨྲས་པ། རིགས་ཀྱི་བུ་དོན་ནི་འདུས་མ་བྱས་པ་སྟེ། ཆོས་གང་དང་ཡང་ལྡན་པའམ་མི་ལྡན་པ་མ་ཡིན་པར་ཁོང་དུ་ཆུད་པར་བྱའོ།།
en: Son of good family,” replied Mañjuśrī, “the object is unconditioned, and hence it should be understood as neither associated with nor dissociated from any phenomena whatsoever.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Why is that?

source: དོན་ནི་འགྱུར་བ་མེད་པའི་མཚན་ཉིད་ཡིན་ཏེ། དེ་ནི་ཆོས་གང་དང་ཡང་ལྡན་པའམ་མི་ལྡན་པ་མ་ཡིན་པར་ཁོང་དུ་ཆུད་པར་བྱའོ།།
en: The object has the characteristic of being immutable, and hence it should be understood as neither associated with nor dissociated from any phenomena whatsoever.

source: དོན་ནི་གཟོད་མ་ནས་ཡོངས་སུ་གྲུབ་པ་མེད་པའི་ཕྱིར་ཆོས་གང་དང་ཡང་ལྡན་པའམ་མི་ལྡན་པ་མ་ཡིན་པར་ཁོང་དུ་ཆུད་པར་བྱའོ།།
en: Because the object lacks any establishment from the beginning, it should be understood as neither associated with nor dissociated from any phenomena whatsoever.

source: དོན་ནི་དོར་བ་མེད་པ་དང་གཞག་པ་མེད་པའི་ཕྱིར་ཆོས་གང་དང་ཡང་ལྡན་པའམ་མི་ལྡན་པ་མ་ཡིན་པར་ཁོང་དུ་ཆུད་པར་བྱའོ།།
en: Because of the absence of elimination and the absence of addition, the object should be understood as neither associated with nor dissociated from any phenomena whatsoever. “

source: ཡེ་ཤེས་ཞེས་བྱ་བ་ནི་ལམ་སྟེ།
en: What is called gnosis is a path.

source: ལམ་ནི་སེམས་དང་ཡང་དག་པར་ལྡན་པ་ཡིན་གྱི་མི་ལྡན་པ་མ་ཡིན་ཏེ།
en: The path is associated with mind rather than dissociated from it.

source: རིགས་ཀྱི་བུ་དེའི་ཕྱིར་ཡེ་ཤེས་ནི་ལྡན་པ་ཞེས་བྱ་སྟེ། མི་ལྡན་པ་མ་ཡིན་ནོ།།
en: Son of good family, therefore, gnosis is said to be associated; it is not dissociated. “

source: ཡེ་ཤེས་ནི་སྤོང་བ་དང་ཡང་དག་པར་ལྡན་པ་ཡིན་གྱི་མི་ལྡན་པ་མ་ཡིན་ཏེ།
en: Gnosis is associated with abandonment, rather than dissociated from it.

source: ཡེ་ཤེས་ཞེས་བྱ་བ་ནི་ཕུང་པོ་ལ་མཁས་པ་དང་། ཁམས་ལ་མཁས་པ་དང་། སྐྱེ་མཆེད་ལ་མཁས་པ་དང་། རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ལ་མཁས་པ་དང་། གནས་དང་གནས་མ་ཡིན་པ་རྣམ་པར་དཔྱད་པ་ལ་མཁས་པ་སྟེ།
en: What is called gnosis is skilled in the aggregates, skilled in the elements, skilled in the sense bases, skilled in dependent origination, and skilled in analyzing what is possible and what is not possible.

source: རིགས་ཀྱི་བུ་དེའི་ཕྱིར་ཡེ་ཤེས་ནི་ལྡན་པ་ཞེས་བྱ་སྟེ།། མི་ལྡན་པ་མ་ཡིན་ནོ།།
en: Therefore, son of good family, gnosis is said to be associated; it is not dissociated. “

source: རིགས་ཀྱི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ཤེས་པ་རྣམ་པ་བཅུ་སྟེ།
en: Furthermore, son of good family, the knowledges of bodhisattva great beings are of ten types.

source: རྣམ་པ་བཅུ་གང་ཞེ་ན།
en: What are the ten types?

source: འདི་ལྟ་སྟེ། རྒྱུ་ཤེས་པ་དང་། འབྲས་བུ་ཤེས་པ་དང་། དོན་ཤེས་པ་དང་། ཐབས་ཤེས་པ་དང་། ཤེས་རབ་ཤེས་པ་དང་། བསྡུ་བ་ཤེས་པ་དང་། ཕ་རོལ་ཏུ་ཕྱིན་པ་ཤེས་པ་དང་། སྙིང་རྗེ་ཆེན་པོ་ཤེས་པ་དང་། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བ་ཤེས་པ་དང་། ཆོས་ཐམས་ཅད་ལ་མངོན་པར་ཞེན་པ་མེད་པར་ཤེས་པ་སྟེ།
en: They are as follows: the knowledge of causes, the knowledge of results, the knowledge of aims, the knowledge of method, the knowledge of wisdom, the knowledge of gathering, the knowledge of the perfections, the knowledge of great compassion, the knowledge of bringing sentient beings to maturity, and the knowledge of not being fixated on any phenomena.

source: རིགས་ཀྱི་བུ་རྣམ་པ་དེ་བཅུ་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ཤེས་པའོ།།
en: Son of good family, these ten are the knowledges of bodhisattva great beings. “

source: རིགས་ཀྱི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་རྩོམ་པ་རྣམ་པ་བཅུ་སྟེ།
en: Furthermore, son of good family, the endeavors of bodhisattva great beings are of ten types.

source: འདི་ལྟ་སྟེ། སེམས་ཅན་ཐམས་ཅད་ཀྱི་ལུས་ཀྱི་ལས་ཡོངས་སུ་སྦྱང་བའི་ཕྱིར་ལུས་ཀྱི་རྩོམ་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་ངག་གི་ལས་ཡོངས་སུ་སྦྱང་བའི་ཕྱིར་ངག་གི་རྩོམ་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཡིད་ཀྱི་ལས་ཡོངས་སུ་སྦྱང་བའི་ཕྱིར་སེམས་ཀྱི་རྩོམ་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ལ་མངོན་པར་ཞེན་པ་མེད་པར་བྱ་བའི་ཕྱིར་ནང་གི་རྩོམ་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ལ་མཚུངས་པར་སྦྱར་བར་བྱ་བའི་ཕྱིར་ཕྱིའི་རྩོམ་པ་དང་། སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་ཡོངས་སུ་རྫོགས་པར་བྱ་བའི་ཕྱིར་ཡེ་ཤེས་ཀྱི་རྩོམ་པ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ཀྱི་ཡོན་ཏན་བཀོད་པ་ཀུན་ཏུ་བསྟན་པའི་ཕྱིར་ཞིང་གི་རྩོམ་པ་དང་། ཉོན་མོངས་པའི་ནད་ཀྱི་སྨན་ཡོངས་སུ་ཤེས་པར་བྱ་བའི་ཕྱིར་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་རྩོམ་པ་དང་། ངེས་པའི་ཕུང་པོ་ཡོངས་སུ་རྫོགས་པར་བྱ་བའི་ཕྱིར་དེ་ཁོ་ནའི་རྩོམ་པ་དང་། ཁམས་གསུམ་པ་ཐམས་ཅད་ལ་སེམས་མངོན་པར་ཞེན་པ་མེད་པར་བྱ་བའི་ཕྱིར་འདུས་མ་བྱས་ཀྱི་ཡེ་ཤེས་ཡོངས་སུ་རྫོགས་པར་བྱ་བའི་རྩོམ་པ་སྟེ།།
en: They are as follows: the endeavor of body for the sake of purifying the physical actions of all sentient beings, the endeavor of speech for the sake of purifying the verbal actions of all sentient beings, the endeavor of mind for the sake of purifying the mental actions of all sentient beings, the internal endeavor for the sake of eliminating fixation on all sentient beings, the external endeavor for the sake of acting equally toward all sentient beings, the endeavor of gnosis for the sake of perfecting the gnosis of buddhas, the endeavor of lands for the sake of fully displaying the array of excellent qualities of all buddha lands, the endeavor of bringing sentient beings to maturity for the sake of developing proficiency in medicines for the illnesses of the afflictions, the endeavor of suchness for the sake of perfecting the domain of certainty, and the endeavor of perfecting the gnosis of the unconditioned for the sake of eliminating the mind’s fixation on all three realms.

source: རིགས་ཀྱི་བུ་རྣམ་པ་འདི་བཅུ་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་རྩོམ་པའོ།།
en: Son of good family, these ten are the endeavors of bodhisattva great beings. “

source: རིགས་ཀྱི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་སྦྱོར་བ་བཅུ་སྟེ།
en: Furthermore, son of good family, the applications of bodhisattva great beings are of ten types.

source: བཅུ་གང་ཞེ་ན།
en: What are the ten?

source: འདི་ལྟ་སྟེ། ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྦྱོར་བ་དང་། བསྡུ་བའི་དངོས་པོའི་སྦྱོར་བ་དང་། ཤེས་རབ་ཀྱི་སྦྱོར་བ་དང་། ཐབས་ཀྱི་སྦྱོར་བ་དང་། སྙིང་རྗེ་ཆེན་པོའི་སྦྱོར་བ་དང་། བསོད་ནམས་ཀྱི་ཚོགས་ཡོངས་སུ་ཚོལ་བའི་སྦྱོར་བ་དང་། ཡེ་ཤེས་ཀྱི་ཚོགས་ཡོངས་སུ་ཚོལ་བའི་སྦྱོར་བ་དང་། བསམ་པ་རྣམ་པར་སྦྱོང་བའི་སྦྱོར་བ་དང་། བདེན་པ་རྣམ་པར་དཔྱད་པའི་སྦྱོར་བ་དང་། སྡུག་པ་དང་མི་སྡུག་པ་ཐམས་ཅད་ལ་མངོན་པར་ཞེན་པ་མེད་པའི་སྦྱོར་བ་སྟེ།
en: They are as follows: the application of the perfections, the application of the means for gathering disciples, the application of wisdom, the application of method, the application of great compassion, the application of seeking the accumulations of merit, the application of seeking the accumulations of gnosis, the application of purifying intentions, the application of analyzing the truths, and the application of the absence of fixation on everything attractive or unattractive.

source: རིགས་ཀྱི་བུ་བཅུ་པོ་དེ་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་སྦྱོར་བའོ།།
en: Son of good family, these ten are the applications of bodhisattva great beings. “

source: རིགས་ཀྱི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་མི་ཟད་པ་ལ་རྟོག་པ་བཅུ་སྟེ།
en: Furthermore, son of good family, bodhisattva great beings’ investigations into the inexhaustible are of ten types.

source: འདི་ལྟ་སྟེ། ལུས་མི་ཟད་པ་ལ་རྟོག་པ་དང་། དངོས་པོ་མི་ཟད་པ་ལ་རྟོག་པ་དང་། ཆོས་མི་ཟད་པ་ལ་རྟོག་པ་དང་། སྲེད་པ་མི་ཟད་པ་ལ་རྟོག་པ་དང་། ལྟ་བ་མི་ཟད་པ་ལ་རྟོག་པ་དང་། ཚོགས་མི་ཟད་པ་ལ་རྟོག་པ་དང་། ཉེ་བར་ལེན་པ་མི་ཟད་པ་ལ་རྟོག་པ་དང་། མངོན་པར་ཞེན་པ་མེད་པ་མི་ཟད་པ་ལ་རྟོག་པ་དང་། འདུ་བ་མི་ཟད་པ་ལ་རྟོག་པ་དང་། བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ཤེས་པ་མི་ཟད་པ་ལ་རྟོག་པ་སྟེ།
en: They are as follows: the investigation into inexhaustible bodies, the investigation into inexhaustible things, the investigation into inexhaustible phenomena, the investigation into inexhaustible craving, the investigation into inexhaustible views, the investigation into inexhaustible accumulations, the investigation into inexhaustible appropriation, the investigation into the inexhaustible absence of fixation, the investigation into inexhaustible conjunctions, and the investigation into the inexhaustible knowledge of the seat of awakening.

source: རིགས་ཀྱི་བུ་བཅུ་པོ་དེ་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་མི་ཟད་པ་ལ་རྟོག་པའོ།།
en: Son of good family, these ten are bodhisattva great beings’ investigations into the inexhaustible subjects. “

source: རིགས་ཀྱི་བུ་གཞན་ཡང་བཅུ་པོ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་འདུལ་བའི་དངོས་པོ་བཅུ་སྟེ།
en: Furthermore, son of good family, these ten are the ten matters that relate to the discipline of bodhisattva great beings.

source: འདི་ལྟ་སྟེ། གཏོང་བའི་ཆར་རབ་ཏུ་འབེབས་པས་སེར་སྣའི་སེམས་འདུལ་བ་ཉིད་དང་། ལས་རྣམ་གསུམ་ཡོངས་སུ་སྦྱོང་བས་འཆལ་པའི་ཚུལ་ཁྲིམས་ཀྱི་སེམས་འདུལ་བ་ཉིད་དང་། བྱམས་པ་སྒོམ་པས་ཁོང་ཁྲོ་བའི་སེམས་འདུལ་བ་ཉིད་དང་། སངས་རྒྱས་ཀྱི་ཆོས་ཡོངས་སུ་བཙལ་བ་ལ་མི་སྐྱོ་བས་ལེ་ལོའི་སེམས་འདུལ་བ་ཉིད་དང་། བསམ་གཏན་དང་རྣམ་པར་ཐར་པར་རྣམ་པར་འཕྲུལ་པས་མི་དགེ་བའི་སེམས་འདུལ་བ་ཉིད་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པས་གཏན་ལ་འབེབས་པ་ལ་མཁས་པའི་ཚོགས་སོགས་པས་མི་ཤེས་པའི་སེམས་འདུལ་བ་ཉིད་དང་། ལམ་གྱི་ཚོགས་བསྐྱེད་པས་ཉོན་མོངས་པ་འདུལ་བ་ཉིད་དང་། ཕྱིན་ཅི་མ་ལོག་པའི་ལམ་བསྐྱེད་པས་བདེན་པའི་ཚོགས་སོགས་པས་འདུལ་བ་ཉིད་དང་། དུས་དང་དུས་མ་ཡིན་པར་དབང་སྒྱུར་བས་སེམས་འདུལ་བ་ཉིད་དང་། བདག་མེད་པའི་ཆོས་ལ་རྟོགས་པས་བདག་འདུལ་བ་ཉིད་དེ།
en: They are as follows: disciplining the mind of miserliness by pouring down a rain of charity, disciplining the mind of corrupt ethical conduct by purifying the three types of actions, disciplining the mind of anger by cultivating love, disciplining the mind of laziness by not tiring in the pursuit of the qualities of the buddhas, disciplining the mind of nonvirtue with the concentrations, liberations, and emanations, disciplining the mind of ignorance by accumulating the collection of skills in reaching a definite conclusion by means of the perfection of wisdom, disciplining the afflictions by generating the accumulations of the paths, disciplining by way of accumulating the collection of truth by generating unerring paths, disciplining the mind by mastery over the timely and untimely, and disciplining the self by realizing the dharma of the absence of self.

source: རིགས་ཀྱི་བུ་བཅུ་པོ་དེ་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་འདུལ་བའི་དངོས་པོའོ།།
en: Son of good family, these ten are the matters that relate to the discipline of bodhisattva great beings. “

source: རིགས་ཀྱི་བུ་གཞན་ཡང་བཅུ་པོ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་དུལ་བའི་ས་སྟེ།
en: Furthermore, son of good family, these ten are the disciplined states of bodhisattva great beings.

source: འདི་ལྟ་སྟེ། ལུས་ཀྱི་ལས་མི་དགེ་བ་རྣམ་པ་གསུམ་ཡོངས་སུ་སྤོང་བས་ལུས་དུལ་བ་ཉིད་དང་། ངག་གི་ལས་རྣམ་པ་བཞི་ཡོངས་སུ་སྤོང་བས་ངག་དུལ་བ་ཉིད་དང་། ཡིད་ཀྱི་ཉེས་པར་སྤྱོད་པ་རྣམ་པ་གསུམ་ཡོངས་སུ་སྤོང་བས་སེམས་དུལ་བ་ཉིད་དང་། རང་གི་ལུས་ལ་མངོན་པར་ཞེན་པ་མེད་པའི་ཚུལ་གྱིས་ནང་དུལ་བ་ཉིད་དང་། ཆོས་ཐམས་ཅད་ལ་མངོན་པར་ཞེན་པ་མེད་པའི་ཚུལ་གྱིས་ཕྱི་རོལ་གྱི་ཡུལ་དུལ་བ་ཉིད་དང་། ལམ་ལ་མངོན་པར་ཞེན་པ་མེད་པའི་ཚུལ་གྱིས་ཡེ་ཤེས་ཀྱི་ཚོགས་ལ་མངོན་པར་ཞེན་པ་མེད་པ་དུལ་བ་ཉིད་དང་། འཕགས་པའི་སའི་ངོ་བོ་ཉིད་ལ་རྟོག་པའི་ཚུལ་གྱིས་བདག་ལ་སྟོད་པ་དུལ་བ་ཉིད་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་པའི་ཚུལ་གྱིས་ཕྱི་མའི་མཐའ་རྣམ་པར་དག་པ་ཡོངས་སུ་སྦྱོང་བ་དུལ་བ་ཉིད་དང་། སེམས་ཅན་ཐམས་ཅད་ལ་མི་སླུ་བའི་ཚུལ་གྱིས་ཐ་སྙད་ཤིན་ཏུ་ཡོངས་སུ་དུལ་བ་ཉིད་དང་། སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བྱེད་པའི་སྙིང་རྗེ་ཆེན་པོའི་ཚུལ་གྱིས་ལུས་དང་སེམས་ལ་མི་ལྟ་བ་དུལ་བ་ཉིད་དེ།
en: They are as follows: the disciplined state of the body through abandoning the three types of nonvirtuous physical action, the disciplined state of speech through abandoning the four types of verbal action, the disciplined state of mind through abandoning the three types of mental misconduct, the internal disciplined state by way of the absence of fixation on one’s body, the disciplined state in regard to external objects by way of the absence of fixation on all phenomena, the disciplined state without fixation on the accumulations of gnosis effected by way of the absence of fixation on paths, the disciplined state in regard to self-aggrandizement by way of investigating the nature of the āryas’ levels, the disciplined state in regard to purifying a pure future by way of remaining in the perfection of wisdom, the highly disciplined state in regard to conventions by way of not deceiving any sentient being, and the disciplined state of disregarding body and mind by way of the great compassion that brings all sentient beings to maturity.

source: རིགས་ཀྱི་བུ་བཅུ་པོ་དེ་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་དུལ་བའི་སའོ།།
en: Son of good family, these ten are the disciplined states of bodhisattva great beings. “

source: རིགས་ཀྱི་བུ་གཞན་ཡང་བྱང་ཆུབ་ནི་སྒྲུབ་པ་སྙིང་པོར་བྱེད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ཡིན་ཏེ། ལོག་པར་སྒྲུབ་པ་སྙིང་པོར་བྱེད་པ་རྣམས་ཀྱི་ནི་མ་ཡིན་ནོ།།
en: Furthermore, son of good family, awakening belongs to bodhisattva great beings who make practice essential; it does not belong to those who make wrong practice essential.

source: དེ་ལ་སྒྲུབ་པ་སྙིང་པོར་བྱེད་པ་ནི་ཇི་སྐད་སྨྲས་པ་དེ་བཞིན་དུ་བྱེད་པ་ཡིན་ནོ།།
en: With respect to that, making practice essential is acting in accordance with what one has said.

source: ལོག་པར་སྒྲུབ་པ་སྙིང་པོར་བྱེད་པ་ནི་ཚིག་གི་དངོས་པོ་ཁོ་ནའོ།།
en: Making wrong practice essential is only a matter of words.

source: དེ་ནི་སྒྲུབ་པ་སྙིང་པོར་བྱེད་པ་མང་བ་ཡིན་གྱི། ལོག་པར་སྒྲུབ་པ་སྙིང་པོར་བྱེད་པ་མང་བ་ནི་མ་ཡིན་ནོ།།
en: With respect to that, making practice essential is manifold; making wrong practice essential is not manifold. “

source: རིགས་ཀྱི་བུ་གཞན་ཡང་གཉིས་པོ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་སྒྲུབ་པ་སྟེ།
en: Furthermore, son of good family, these two are the practices of bodhisattva great beings.

source: འདི་ལྟ་སྟེ། ལམ་སྒྲུབ་པ་དང་། སྤོང་བ་སྒྲུབ་པ་སྟེ།།
en: They are the practice of the path and the practice of abandonment.

source: རིགས་ཀྱི་བུ་གཉིས་པོ་དེ་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་སྒྲུབ་པའོ།།
en: Son of good family, these two are the practices of bodhisattva great beings. “

source: རིགས་ཀྱི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་སྒྲུབ་པ་གཉིས་ཏེ།
en: Furthermore, son of good family, there are two practices of bodhisattva great beings.

source: འདི་ལྟ་སྟེ། བདག་འདུལ་བའི་སྒྲུབ་པ་དང་། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་སྒྲུབ་པ་སྟེ།།
en: They are the practice of subduing oneself and the practice of bringing sentient beings to maturity.

source: འདི་ལྟ་སྟེ།། རྩོལ་བ་དང་བཅས་པའི་ཤེས་པས་སྒྲུབ་པ་དང་། ལྷུན་གྱིས་གྲུབ་པའི་ཡེ་ཤེས་ཀྱིས་སྒྲུབ་པ་སྟེ།
en: They are the practice through knowledge that is coupled with effort and the practice through spontaneous gnosis.

source: འདི་ལྟ་སྟེ། ས་རྣམ་པར་གཞག་པ་ལ་མཁས་པར་སྒྲུབ་པ་དང་། ས་དབྱེར་མེད་པ་ལ་མཁས་པར་སྒྲུབ་པ་སྟེ།
en: They are the practice in skill at establishing the levels and the practice in skill at the undifferentiated level.

source: འདི་ལྟ་སྟེ། སའི་ཉེས་པ་རྣམ་པར་སྤོང་བའི་སྒྲུབ་པ་དང་། ས་ནས་སར་འཕར་བ་ལ་མཁས་པ་ཡོངས་སུ་རྫོགས་པར་བྱ་བའི་སྒྲུབ་པ་སྟེ།
en: They are the practice that abandons the flaws related to the levels and the practice that completes the skill in advancing from one level to another.

source: འདི་ལྟ་སྟེ། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་ས་བསྟན་པའི་སྒྲུབ་པ་དང་། སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པ་ལ་མཁས་པའི་སྒྲུབ་པ་སྟེ།
en: They are the practice of the teachings on the levels of śrāvakas and pratyekabuddhas and the practice that is skilled in being irreversible from the awakening of a buddha.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་སྒྲུབ་པ་ནི་འདི་ལྟ་བུ་འདི་དག་སྟེ།
en: Son of good family, the practices of bodhisattva great beings are those that are like this.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱིས་འབད་པར་བྱའོ།།
en: Bodhisattva great beings should make effort in them.
